//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕстьЧеловекСВозрастомЛет(Парам01)","ЕстьЧеловекСВозрастомЛет","Допустим Есть человек с возрастом 25 лет");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯВвожуВозрастЧеловека(Парам01)","ЯВвожуВозрастЧеловека","Когда Я ввожу возраст человека 25");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НажимаюНаКнопку(Парам01)","НажимаюНаКнопку","И нажимаю на кнопку ""Рассчитать""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПоявляетсяСообщениеСУказаниемВозрастаЧеловекаВМесяцах(Парам01)","ПоявляетсяСообщениеСУказаниемВозрастаЧеловекаВМесяцах","Тогда Появляется сообщение с указанием возраста человека в месяцах 300");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим Есть человек с возрастом 25 лет
//@ЕстьЧеловекСВозрастомЛет(Парам01)
Процедура ЕстьЧеловекСВозрастомЛет(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Контекст.Вставить("Возраст", Парам01);
КонецПроцедуры

&НаКлиенте
//Когда Я ввожу возраст человека 25
//@ЯВвожуВозрастЧеловека(Парам01)
Процедура ЯВвожуВозрастЧеловека(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВведенныйВозраст = 0;
	Если Контекст.Свойство("Возраст", ВведенныйВозраст) И ВведенныйВозраст>0 Тогда
				
	Иначе 
		ВызватьИсключение "Возраст введен не верно. Он должен быть больше нуля";	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//И нажимаю на кнопку "Рассчитать"
//@НажимаюНаКнопку(Парам01)
Процедура НажимаюНаКнопку(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	////ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда Появляется сообщение с указанием возраста человека в месяцах 300
//@ПоявляетсяСообщениеСУказаниемВозрастаЧеловекаВМесяцах(Парам01)
Процедура ПоявляетсяСообщениеСУказаниемВозрастаЧеловекаВМесяцах(ОжидаемыйРезультат) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Результат = ПолучитьРезультат(Контекст.Возраст);
	Если Результат<>ОжидаемыйРезультат Тогда 
		ВызватьИсключение "Результат рассчитан не верно";
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
функция ПолучитьРезультат(прВозраст)
	Возврат Обработки.РасчетВозрастаСотрудника.ПолучитьВозрастСотрудника(прВозраст);
КонецФункции

//окончание текста модуля